:PROPERTIES:
:ID:       ae44fe2d-68c0-41f8-bc4f-08992e3090ed
:END:
#+TITLE: Research summary
#+SUBTITLE: Inherent structures of the deep Boltzmann machine
#+CATEGORY: notes
#+FILETAGS: :fleeting: :phd: :submission:
#+SETUPFILE: ~/.config/emacs/setup/setupfile.org

The deep Boltzmann machine (DBM) is a statistical model for parametric inference [cite:@salakhutdinov2009deep]. The state of a DBM with \(L\) hidden layers is a set of binary variables \(\boldsymbol{\sigma} \equiv (\sigma_{il} \in \{\pm 1\})_{l=0 \ldots L}^{i = 1 \ldots N_{l}}\). \(\boldsymbol{N} \equiv (N_{l})_{l=0\ldots L}\) is the number of units in each of the \(L+1\) layers. The set of DBM configurations live in a state space \(\mathcal{S} \equiv \{\pm 1\}^{N_{0}} \times \{\pm 1\}^{N_{1}} \times \cdots \times \{\pm 1\}^{N_{L}}\) so that \(|\mathcal{S}| = \prod_{l=0}^{L} 2^{N_{l}}\). The joint probability density function \(p (\boldsymbol{\sigma})\) that assigns objective probabilities to \(\boldsymbol{\sigma} \in \mathcal{S}\) is

\begin{align*}
p (\boldsymbol{\sigma}) = \mathcal{Z}^{-1} \exp \big[- H_{\boldsymbol{J}} (\boldsymbol{\sigma}) \big] \quad \mathcal{Z} \equiv \sum_{\boldsymbol{\sigma}} \exp \big[- H_{\boldsymbol{J}} (\boldsymbol{\sigma}) \big].  \tag{1}
\end{align*}

** Hubbard-Stratonovich transformations
Next we make a mean-field approximation and linearize the cross terms \(k_{il} k_{j(l+1)}\) appearing in (7). Using auxiliary variables \((x_{l})_{l=0 \ldots L-1}\), and \((y_{l})_{l=0 \ldots L-1}\), we write

\begin{align*}
\exp \bigg \{\frac{1}{\widehat{N}_{l}} \sum_{ij} k_{il} k_{j(l+1)} \bigg \} &= \bigg(\frac{\widehat{N}_{l}}{\pi}\bigg) \int_{-\infty}^{\infty} \mathrm{d} x_{l} \exp \bigg\{- \widehat{N}_{l} \thinspace x_{l}^{2} + \bigg( \sum_{i=1}^{N_{l}} k_{il} x_{l} + \sum_{j=1}^{N_{l+1}} k_{j(l+1)} x_{l} \bigg) \bigg\} \\
&\qquad \int_{-\infty}^{\infty} \mathrm{d} y_{l} \times \exp \bigg\{- \widehat{N}_{l} \thinspace y_{l}^{2} - i \bigg( \sum_{i=1}^{N_{l}} k_{il} y_{l} - \sum_{j=1}^{N_{l+1}} k_{j(l+1)} y_{l} \bigg)  \bigg\} \tag{8}
\end{align*}

We have used an integral transform

\begin{align*}
\exp \bigg(\frac{b c}{a} \bigg) = (a / \pi) \bigg( \int_{-\infty}^{\infty} \mathrm{d} x \exp \big[  - a x^{2} + (b + c) x \big] \bigg) \bigg( \int_{-\infty}^{\infty} \mathrm{d} y \exp \big[ - a y^{2} - i (b - c) y \big] \bigg), \qquad a > 0 \tag{9}
\end{align*}

#+begin_src python :results output
from sympy import symbols, exp, integrate, oo, I, pi, simplify
# Re-initialize symbols (for clarity in this standalone script)
a, b, c, x, y = symbols('a b c x y')
# Define the integrals with the assumption a > 0 explicitly stated where necessary
integral_x = integrate(exp(-a*x**2 + (b + c)*x), (x, -oo, oo), conds='none')
integral_y = integrate(exp(-a*y**2 - I*(b - c)*y), (y, -oo, oo), conds='none')
# Calculate the product of the two integrals, then multiply by (a / pi)
product_scaled = (a / pi) * integral_x * integral_y
# Simplify the expression
result = simplify(product_scaled)
# Print the result in LaTeX
print(result)
#+end_src

#+RESULTS:
: exp(b*c/a)

with \(a = \widehat{N}_{l}\), \(b = \sum_{i=1}^{N_{l}} k_{il}\) and \(c = \sum_{j=1}^{N_{l+1}} k_{j(l+1)}\). Substitution in (8) yields

\begin{align*}
2 \thinspace \langle \mathcal{N}_{s} \rangle_{J} &= (i \pi)^{- N} \int_{-\infty}^{\infty} \prod_{l=0}^{L-1} \big(\widehat{N}_{l} / \pi \big)  \big( \mathrm{d} y_{l} \mathrm{d} x_{l} \big) \exp \bigg\{ - \sum_{l=0}^{L-1} \widehat{N}_{l} \big( x_{l}^{2} + y_{l}^{2} \big) \bigg\} \int_0^{\infty} \prod_{ i l} \mathrm{d} \lambda_{il} \\
&\times \int_{-\infty}^{\infty} \prod_{l=1}^{L-1} \prod_{i=1}^{N_{l}} \mathrm{d} k_{il} \exp \bigg\{\sum_{l=1}^{L - 1} \sum_{i=1}^{N_{l}} \bigg(- \frac{1}{2} \big( \gamma_{l} + \nu_{l} \big) k_{il}^{2} + i \big[(x_{l} + x_{l-1}) - i (y_{l} - y_{l-1}) + \lambda_{il} \big] k_{il} \bigg) \bigg\} \\
&\qquad \qquad \qquad \times \int_{-\infty}^{\infty} \prod_{i=1}^{N_{0}} \mathrm{d} k_{i0} \exp \bigg\{ \sum_{i=1}^{N_{0}} \bigg(- \frac{1}{2} \gamma_{0} k_{i0}^{2}  + i \big[x_{0} - i y_{0} + \lambda_{i0} \big]  k_{i0} \bigg) \bigg \} \\
&\qquad \qquad \qquad \qquad \qquad \times \int_{-\infty}^{\infty} \prod_{i=1}^{N_{L}} \mathrm{d} k_{iL} \exp \bigg\{\sum_{i=1}^{N_{L}} \bigg( - \frac{1}{2} \nu_{L} k_{iL}^{2} + i \big[ x_{L-1} + i y_{L-1} + \lambda_{iL} \big] k_{iL} \bigg) \bigg \}. \tag{10}
\end{align*}

We have effected \(k_{il} \to i k_{il}\) for the variables \((k_{il})_{l=0 \ldots L}^{i=1 \ldots N_{l}}\) so that the integral is along the real line. We use the result

\[
\int_{-\infty}^{\infty} \mathrm{~d}x \exp \bigg( - \frac{1}{2} a x^{2} + i b x \bigg) = \bigg(\frac{2 \pi}{a} \bigg)^{1/2} \exp \bigg(- \frac{b^2}{2a} \bigg) \qquad a > 0,
\]

with appropriately chosen \(a\) and \(b\) to evaluate the \(k_{il}\) integrals. For \(l = 0\), \(a = \gamma_{0}\) and \(b = (x_{0} - i y_{0} + \lambda_{i0})\). For \(0 < l < L\), \(a = (\gamma_{l} + \nu_{l})\) and \(b = (x_{l} + x_{l-1} - i (y_{l} - y_{l-1}) + \lambda_{il})\). For \(l = L\), \(a = \nu_{L}\) and \(b = (x_{L-1} + i y_{L-1} + \lambda_{iL})\). After evaluation,

\begin{align*}
2& \thinspace \langle \mathcal{N}_{s} \rangle_{J} = \pi^{-N} \pi^{N/2} \bigg(\frac{2}{\gamma_{0}}\bigg)^{N_{0}/2} \bigg(\frac{2}{\nu_{L}}\bigg)^{N_{L}/2} \prod_{l=1}^{L-1} \bigg(\frac{2}{\gamma_{l} + \nu_{l}} \bigg)^{N_{l}/2} \\
&\quad \int_{-\infty}^{\infty} \prod_{l=0}^{L-1} \big(\widehat{N}_{l} / \pi \big)  \big( \mathrm{d} y_{l} \mathrm{d} x_{l} \big)  \exp \bigg\{ - \sum_{l=0}^{L-1} \widehat{N}_{l} \big( x_{l}^{2} + y_{l}^{2} \big) \bigg\} \\
&\quad \times \int_0^{\infty} \prod_{i=1}^{N_0} \mathrm{d} \lambda_{i0} \exp \bigg \{ \sum_{i=1}^{N_{0}} \bigg( -\frac{\lambda_{i0}^{2}}{2 \gamma_{0}} + \frac{\lambda_{i0} \big(- x_{0} + i y_{0}\big)}{\gamma_{0}} \bigg) \bigg \} \\
&\quad \times \int_0^{\infty} \prod_{i=1}^{N_L} \mathrm{d} \lambda_{iL} \exp \bigg \{  \sum_{i=1}^{N_{L}} \bigg(- \frac{\lambda_{iL}^{2}}{2 \nu_{L}} + \frac{\lambda_{iL} \big(- x_{L-1} - i y_{L-1}\big)}{\nu_{L}} \bigg) \bigg\} \\
&\quad \times  \int_0^{\infty} \prod_{l=1}^{L-1} \prod_{i=1}^{N_l} \mathrm{d} \lambda_{il} \exp \bigg\{ \sum_{l=1}^{L - 1} \sum_{i=1}^{N_{l}} \bigg( - \frac{\lambda_{il}^{2}}{2 (\gamma_{l} + \nu_{l})} + \frac{\lambda_{il} \big[- (x_{l} + x_{l-1}) + i (y_{l} - y_{l-1})\big]}{(\gamma_{l} + \nu_{l})} \bigg) \bigg \} \\
&\quad \times  \exp \bigg\{ - \sum_{l=1}^{L - 1} \sum_{i=1}^{N_{l}} \frac{\big[(x_{l} + x_{l-1}) - i (y_{l} - y_{l-1})\big]^{2}}{2 (\gamma_{l} + \nu_{l})} - \sum_{i=1}^{N_{0}} \frac{\big(x_{0} - i y_{0}\big)^{2}}{2 \gamma_{0}} - \sum_{i=1}^{N_{L}} \frac{\big(x_{L-1} + i y_{L-1}\big)^{2}}{2 \nu_{L}} \bigg\} \tag{11}
\end{align*}

